
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Лекция 7: Block ACK, MIMO, 802.11ac · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lec8.html" />
    
    
    <link rel="prev" href="lec6.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    WiFi
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="lec1.html">
            
                <a href="lec1.html">
            
                    
                    Лекция 1: Многошаговые сети: Manet
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="lec2.html">
            
                <a href="lec2.html">
            
                    
                    Лекция 2: Многошаговые сети: Критерии
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.2.1" data-path="hw2.html">
            
                <a href="hw2.html">
            
                    
                    Решение ДЗ
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="lec3.html">
            
                <a href="lec3.html">
            
                    
                    Лекция 3: Mesh сети
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="lec4.html">
            
                <a href="lec4.html">
            
                    
                    Лекция 4: Mesh + MCCA
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="lec5.html">
            
                <a href="lec5.html">
            
                    
                    Лекция 5: Высокоскоростной WiFi: Обзор
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="lec6.html">
            
                <a href="lec6.html">
            
                    
                    Лекция 6: 802.11ax: Введение
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.7" data-path="lec7.html">
            
                <a href="lec7.html">
            
                    
                    Лекция 7: Block ACK, MIMO, 802.11ac
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="lec8.html">
            
                <a href="lec8.html">
            
                    
                    Лекция 8: 802.11ax: Продолжение
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="lec9.html">
            
                <a href="lec9.html">
            
                    
                    Лекция 9: 802.11ax: Завершение
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="lec10.html">
            
                <a href="lec10.html">
            
                    
                    Лекция 10: 802.11ad, ay: WiFi в mm диапазоне
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Лекция 7: Block ACK, MIMO, 802.11ac</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="blockack">BlockACK</h3>
<p>&#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x435; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x430;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x43E;&#x432;</p>
<p>2 &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F;: </p>
<p>Immediate</p>
<p>Delayed</p>
<p>BlockACK &#x43F;&#x43E;&#x44F;&#x432;&#x438;&#x43B;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x437;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D; &#x432; &#x434;&#x440;&#x430;&#x439;&#x432;&#x435;&#x440;&#x435;, &#x430; &#x43D;&#x435; &#x432; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x435;.</p>
<p>&#x421;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x44B;&#x43C; &#x43F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; Delayed -- &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43C;&#x435;&#x434;&#x43B;&#x435;&#x43D;&#x43D;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x432; &#x434;&#x440;&#x430;&#x439;&#x432;&#x435;&#x440;&#x435;.</p>
<p>&quot;&#x411;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x437;&#x430;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430;, &#x43D;&#x43E; &#x437;&#x430;&#x442;&#x43E; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E;&quot;</p>
<p>&#x41A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441;&#x43C; &#x43D;&#x430; &#x441;&#x43B;&#x430;&#x439;&#x434;&#x435;</p>
<p>&#x41C;&#x44B; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x438; BlockACKReq.</p>
<p>&#x421;&#x442;&#x430;&#x43D;&#x446;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430; BlockACKReq - &#x437;&#x43D;&#x430;&#x435;&#x442; &#x434;&#x43E;&#x448;&#x43B;&#x43E; &#x43B;&#x438; &#x438;&#x43B;&#x438; &#x43D;&#x435;&#x442; (&#x43F;&#x43E; BlockACK) -- &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x435;&#x442; -- &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;.</p>
<p>&#x412; immediate &#x43D;&#x435; &#x43D;&#x443;&#x436;&#x435;&#x43D; ACK &#x43D;&#x430; BlockACK, &#x43D;&#x43E; &#x432; delayed &#x43D;&#x443;&#x436;&#x435;&#x43D; .</p>
<p>BlockACKReq -- &#x438;&#x43C;&#x435;&#x435;&#x442; 2 &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x44F;: BARControl, &#x432; &#x43D;&#x435;&#x43C; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D; TID (&#x442;&#x438;&#x43F; &#x442;&#x440;&#x430;&#x444;&#x438;&#x43A;&#x430;)</p>
<p>BlockACKStartingSequnceControl -- &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x438;&#x442; &#x438;&#x437; 2 &#x43F;&#x43E;&#x434;&#x43F;&#x43E;&#x43B;&#x435;&#x439;: &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430;, &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x444;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x430;.</p>
<p>&#x412; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442; BlockACKResponse.</p>
<p>&#x432; 11n &#x431;&#x44B;&#x43B;&#x43E; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x435;&#x43D;&#x43E;.</p>
<p>BlockACK &#x431;&#x44B;&#x43B; &#x43E;&#x434;&#x438;&#x43D; -- Basic, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x441;&#x436;&#x430;&#x442;&#x44B;&#x439; &#x438; multi-tid</p>
<p>&#x412; BARControl  &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x44B;&#x43C;&#x438; &#x43F;&#x43E;&#x43B;&#x44F;&#x43C;&#x438; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; Multi-tid &#x438; compressed.</p>
<p>Multi-tid blockACKReq  &#x43F;&#x43E;&#x44F;&#x432;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43F;&#x43E;&#x43B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x434;&#x43B;&#x438;&#x43D;&#x44B;, &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; TID &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; SequenceControl.</p>
<p>&#x412; Compressed &#x43C;&#x44B; &#x443;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; MSDU, &#x430; &#x43D;&#x435; &#x444;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x44B;.</p>
<p>ADDBA Request -- starting sequence number, BlockACK timeout, BufferSize</p>
<p>ADDBA Responce -- buffer size, Block Ack timeout</p>
<p>ADDBA: </p>
<ul>
<li>Dialog Token</li>
<li>Block Ack Parameter Set</li>
<li>Block Ack Timeout Valuse</li>
</ul>
<p>&#x41F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x43F;&#x44B;&#x442;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;: </p>
<p>&#x414;&#x435;&#x43B;&#x430;&#x435;&#x43C; &#x43F;&#x43E;&#x43F;&#x44B;&#x442;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x43D;&#x435; &#x43F;&#x43E; retry-limit, &#x430; &#x43F;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x436;&#x438;&#x437;&#x43D;&#x438; MSDU.</p>
<p>&#x414;&#x435;&#x43B;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x43E;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x43F;&#x43E; &#x43F;&#x43E;&#x43B;&#x430;&#x43C;, &#x432;&#x441;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x43E;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; - &#x43D;&#x43E;&#x432;&#x44B;&#x435;, &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; -- &#x441;&#x442;&#x430;&#x440;&#x44B;&#x435;.</p>
<p>&#x421;&#x43C;. &#x43F;&#x438;&#x43A;&#x447;&#x443; &#x441;&#x43E; &#x441;&#x43B;&#x430;&#x439;&#x434;&#x43E;&#x432; (&#x441; &#x43A;&#x440;&#x443;&#x433;&#x43E;&#x43C;)</p>
<p>&#x415;&#x441;&#x442;&#x44C; &#x431;&#x443;&#x444;&#x444;&#x435;&#x440; &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x43C; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x44B; (msdu) &#x43D;&#x430;&#x432;&#x435;&#x440;&#x445; &#x434;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x434;&#x44B;&#x440;&#x43A;&#x438;.</p>
<p>&#x41F;&#x430;&#x43A;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x43C; &#x43D;&#x430;&#x432;&#x435;&#x440;&#x445; &#x43F;&#x43E; lifetime.</p>
<p>&#x41E;&#x43A;&#x43D;&#x43E; &#x441;&#x434;&#x432;&#x438;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x435;&#x441;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x448;&#x435;&#x43B; &#x43A;&#x430;&#x434;&#x440; &#x437;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x430;&#x43C;&#x438; &#x43E;&#x43A;&#x43D;&#x430;, &#x43B;&#x438;&#x431;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; &#x44D;&#x442;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B; BlockACK.</p>
<p>11e -- &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x445;&#x43D;&#x43E;&#x441;&#x442;&#x43D;&#x43E;, 11n -- &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435;.</p>
<h3 id="mimo">MIMO</h3>
<p>&#x411;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x430;&#x440;&#x44F; MIMO &#x43C;&#x44B; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x43C; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x442;&#x44C; payload (&#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x438;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x445; &#x432; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x443; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438;).</p>
<p>STBC -- &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x442;&#x438;&#x43F; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x43E;&#x432;  &#x437;&#x430; &#x441;&#x447;&#x435;&#x442; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x43F;&#x43E; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x43C; &#x430;&#x43D;&#x442;&#x435;&#x43D;&#x43D;&#x430;&#x43C; &#x438;&#x434;&#x435;&#x442; &#x43E;&#x434;&#x438;&#x43D; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;.</p>
<p>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x443; &#x43D;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x430;&#x43D;&#x442;&#x435;&#x43D;&#x43D;, &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; sparcial-stream -- &#x441;&#x442;&#x430;&#x440;&#x434;&#x430;&#x435;&#x442; &#x434;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x44D;&#x442;&#x43E;&#x442; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x432;&#x44B;&#x433;&#x43E;&#x434;&#x43D;&#x435;&#x435; &#x43D;&#x430; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x431;&#x43B;&#x438;&#x437;&#x43A;&#x438;&#x445; &#x440;&#x430;&#x441;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;&#x445;.</p>
<p>&#x421;&#x443;&#x442;&#x44C; sparcial-stream: &#x444;&#x438;&#x437;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x435;&#x441;&#x442;&#x44C;, &#x432;&#x43E;&#x442; &#x43E;&#x43D; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x435;&#x435;.</p>
<p>&#x414;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; MIMO &#x43A;&#x430;&#x434;&#x440; &#x443;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F;: &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435;  &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442; &quot;&#x43D;&#x430;&#x442;&#x440;&#x435;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;&quot; &#x43A;&#x430;&#x43D;&#x430;&#x43B; + &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B;.</p>
<p>HT-SIG - &#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x421;&#x421;&#x41A;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43B;&#x438; MIMO, &#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; sparcial &#x441;&#x442;&#x440;&#x438;&#x43C;&#x43E;&#x432;.</p>
<p>&#x414;&#x430;&#x43B;&#x435;&#x435; &#x438;&#x434;&#x443;&#x442; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x442;&#x440;&#x435;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x43E;&#x447;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; &#x43F;&#x43E; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; sparcial &#x441;&#x442;&#x440;&#x438;&#x43C;&#x43E;&#x432; + &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x441;&#x438;&#x432;&#x435;&#x440;&#x430;.</p>
<p>&#x412; 11a &#x43F;&#x43E;&#x43B;&#x435; signal &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43B;&#x43E; &#x421;&#x421;&#x41A; &#x438; &#x434;&#x43B;&#x438;&#x43D;&#x443; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430;.</p>
<p>&#x41A;&#x430;&#x434;&#x440;&#x44B; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x44B;&#x43C;&#x438;.</p>
<p>&#x424;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x435;&#x43C;&#x43D;&#x438;&#x43A;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x440;&#x435;&#x448;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43B;&#x438;&#x43D;&#x435;&#x439;&#x43D;&#x44B;&#x435; &#x443;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43E;&#x446;&#x435;&#x43D;&#x43A;&#x443; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430;.</p>
<p>L-SIG -- &#x443;&#x43A;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C;, &#x434;&#x43B;&#x438;&#x43D;&#x430; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430; (&#x444;&#x435;&#x439;&#x43A;&#x43E;&#x432;&#x430;&#x44F;)</p>
<p>HT-GREENFIELD-PPDU -- &quot;&#x437;&#x435;&#x43B;&#x435;&#x43D;&#x43E;&#x435;&quot; &#x43F;&#x43E;&#x43B;&#x435;, &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x447;&#x442;&#x43E; legacy-&#x441;&#x442;&#x430;&#x43D;&#x446;&#x438;&#x439; &#x43D;&#x435;&#x442;, &#x438; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x436;&#x430;&#x442;&#x44B;&#x439; &#x43A;&#x430;&#x434;&#x440;.</p>
<p>max HT length - 64&#x41A;&#x431;.</p>
<p>&#x414;&#x43B;&#x438;&#x43D;&#x430; &#x43A;&#x430;&#x434;&#x440;&#x430; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F;</p>
<p>A-MSDU</p>
<h4 id="blockack-modifications">BlockAck Modifications</h4>
<p>&#x414;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x445; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;:</p>
<p> Full state -- always maintain the bitmap.</p>
<p>Partial-state -- can reset the bitmap if frames from another transmitter are received</p>
<p>L-SIG TXOP Protection -- &#x437;&#x430;&#x449;&#x438;&#x442;&#x430; TXOP &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x442;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x43C;&#x44B; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x43B;&#x438; &#x432; &#x43F;&#x43E;&#x43B;&#x435; L-SIG.</p>
<p>&#x412; L-SIG -- &#x43D;&#x435;&#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x44B;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; (&#x444;&#x435;&#x439;&#x43A;&#x43E;&#x432;&#x430;&#x44F; &#x434;&#x43B;&#x438;&#x43D;&#x430; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430;). &#x411;&#x443;&#x434;&#x435;&#x43C; &#x432;&#x44B;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x435;, &#x447;&#x435;&#x43C; &#x43D;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x43D;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x430;&#x434;&#x440;&#x430; + &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x432; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x443;&#x44E; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x443;.</p>
<p>&#x422;&#x430; &#x441;&#x442;&#x430;&#x43D;&#x446;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x443;&#x441;&#x43B;&#x44B;&#x448;&#x438;&#x442; L-SIG &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x437;&#x430;&#x43D;&#x44F;&#x442; &#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;.</p>
<p>NAV, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x444;&#x438;&#x437;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x43C; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435;.</p>
<p>&#x414;&#x43B;&#x44F; durationid &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x435;&#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; RTS/CTS, &#x435;&#x441;&#x43B;&#x438; &#x43A;&#x430;&#x43A;&#x430;&#x44F;-&#x442;&#x43E; &#x438;&#x437; &#x441;&#x442;&#x430;&#x43D;&#x446;&#x438;&#x439; &#x435;&#x433;&#x43E; &#x43D;&#x435; &#x441;&#x43B;&#x44B;&#x448;&#x438;&#x442;, &#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x432; &#x438;&#x437; &#x43F;&#x43E;&#x43B;&#x44F; L-SIG &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;, &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x435;&#x439; &#x43D;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x434;&#x435;&#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438; &#x432;&#x441;&#x435; &#x43D;&#x43E;&#x440;&#x43C;.</p>
<h3 id="80211-ac-channel-bonding">802.11 ac: Channel bonding</h3>
<p>&#x412; 11ac &#x441;&#x442;&#x430;&#x43B;&#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x43B;&#x43E;&#x441;&#x44B; &#x434;&#x43E; 160&#x41C;&#x433;&#x446;.</p>
<p>&#x412;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; primary 20&#x41C;&#x433;&#x446; &#x43A;&#x430;&#x43D;&#x430;&#x43B;.</p>
<p>Primary &#x438; secondary.</p>
<p>Primary &#x43F;&#x43E;&#x43B;&#x43E;&#x432;&#x438;&#x43D;&#x430; -- &#x442;&#x430;&#x43C; &#x433;&#x434;&#x435; &#x43B;&#x435;&#x436;&#x438;&#x442; primary20, &#x432;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43F;&#x43E;&#x43B;&#x43E;&#x432;&#x438;&#x43D;&#x430; secondary.</p>
<p>2.4 &#x43D;&#x435;&#x43B;&#x44C;&#x437;&#x44F; -- &#x43D;&#x435; &#x445;&#x432;&#x430;&#x442;&#x438;&#x442; &#x448;&#x438;&#x440;&#x438;&#x43D;&#x44B; &#x43F;&#x43E;&#x43B;&#x43E;&#x441;&#x44B;.</p>
<p>backoff &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x43C; &#x432; primary20 (&#x441;&#x43B;&#x443;&#x448;&#x430;&#x435;&#x43C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x435;&#x433;&#x43E;), &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x432;&#x435;&#x441;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443; &#x438; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x43C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x435; &#x432;&#x435;&#x441;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443;. &#x415;&#x441;&#x43B;&#x438; secondary &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x431;&#x44B;&#x43B; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x435;&#x43D; &#x432; &#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; PIFS &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x435;&#x433;&#x43E; &#x437;&#x430;&#x434;&#x435;&#x439;&#x441;&#x442;&#x43E;&#x432;&#x430;&#x442;&#x44C;, &#x435;&#x441;&#x43B;&#x438; secondary40 &#x431;&#x44B;&#x43B; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x435;&#x43D; &#x432; &#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; PIFS, &#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x43C; &#x432; 80&#x41C;&#x433;&#x446;, &#x435;&#x441;&#x43B;&#x438; secondary80 &#x431;&#x44B;&#x43B; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x435;&#x43D; &#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x43C; &#x432; 160 &#x41C;&#x413;&#x446;.</p>
<p>&#x41A;&#x430;&#x434;&#x440; RTS/CTS &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43E; &#x432;&#x441;&#x435;&#x439; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x43E;&#x439; &#x43F;&#x43E;&#x43B;&#x43E;&#x441;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43A;&#x440;&#x44B;&#x442;&#x44C; &#x432;&#x441;&#x44E; &#x431;&#x443;&#x434;&#x443;&#x449;&#x443;&#x44E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443;.</p>
<p>CTS &#x2014; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432; legacy &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x435;. (&#x432; 20 &#x41C;&#x433;&#x446;)</p>
<p>&#x412;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;: &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x432;&#x448;&#x438;&#x441;&#x44C; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x44C;&#x442;&#x435;, &#x447;&#x442;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441; RTS, BlockAck, BlockAckRequest.</p>
<p>&#x412; 11ac MU-MIMO - &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x43C; &#x441;&#x442;&#x430;&#x43D;&#x446;&#x438;&#x44F;&#x43C;.</p>
<p>&#x41C;&#x44B; &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x43C; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x43C; &#x441;&#x442;&#x430;&#x43D;&#x446;&#x438;&#x44F;&#x43C;.</p>
<p>Backoff &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x43C; &#x432; primary, &#x430; &#x432;&#x44B;&#x431;&#x43E;&#x440; primary / secondary &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x432; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438;:</p>
<ul>
<li>20</li>
<li>40</li>
<li>80</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lec6.html" class="navigation navigation-prev " aria-label="Previous page: Лекция 6: 802.11ax: Введение">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lec8.html" class="navigation navigation-next " aria-label="Next page: Лекция 8: 802.11ax: Продолжение">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Лекция 7: Block ACK, MIMO, 802.11ac","level":"1.2.7","depth":2,"next":{"title":"Лекция 8: 802.11ax: Продолжение","level":"1.2.8","depth":2,"path":"wifi/lec8.md","ref":"./wifi/lec8.md","articles":[]},"previous":{"title":"Лекция 6: 802.11ax: Введение","level":"1.2.6","depth":2,"path":"wifi/lec6.md","ref":"./wifi/lec6.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["katex@git+https://github.com/Nikscorp/plugin-katex.git"],"pluginsConfig":{"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"wifi/lec7.md","mtime":"2019-06-10T20:11:24.564Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-10T20:12:37.760Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

